<?php

namespace Database\Seeders;

use App\Models\Post;
use Illuminate\Database\Seeder;

class PostSeeder extends Seeder
{
    public $posts = [
        [
            "title" => "Հայկական Գամփռ ",
            "content" => "Հայկական Գամփռ անունը կրող այս ցեղատեսակը հայ ժողովրդի պատմության, մշակույթի և կյանքի անբաժանելի մասն է։

Գամփռը Հայկական լեռնաշխարհի բնիկ շնացեղատեսակ է։ Անհիշելի ժամանակներից մարդիկ այստեղ ընտելացրել և օգտագործել են բազմաթիվ կենդանիներ՝ շներ և կատուներ, այծեր և ոչխարներ, ձիեր և էշեր, նույնիսկ որսահալած լուսաններ և այլն։ Գամփռն առանձնանում է այս բոլոր կենդանիներից, քանի որ նա մարդուն ուղեկցել է ամենուրեք՝ անասնապահության և հողագործության ժամանակ, որսորդության և կենդանիներ ընտելացնելիս, ստեղծագործելիս, պատերազմելիս և հանգստանալիս։

Այս առանձնահատուկ շնացեղատեսակը, որին անվանում ենք Հայկական գամփռ, ձևավորվել է հազարամյակների նպատակաուղղված անխոնջ բուծման, յուրահատուկ բնակլիմայական ընտրության, ու արտաքին աշխարհից մեկուսացման պայմաններում։",
            "image" => "IMG_4125.webp",
        ],
        [
            "title" => "Գամփռներն աշխատանքային շներ են",
            "content" => "Հիմնականում օգտագործվել են որպես հովվաշներ, պահապաններ, որսաշներ, պատերազմի շներ, փրկարար շներ: Մարդկանց հավատն ու սերը հավատարիմ կենդանիների նկատմամբ եղել է անվերապահ և անսահման։
Հայկական բանահյուսությունում միշտ գովերգվել է Գամփռը առասպելական խիզախության, իմաստության, ուժի, գեղեցկության, ազնվության և անսահման հավատարմության համար։ Մարդիկ այնքան են կապված եղել շներին, որ ունեցել են իրենց շուն աստվածը՝ Արալեզը, որը կարողացել է լիզելով ապաքինել վերքերը և վերակենդանացնել մարդկանց: Հայոց ազգի հինավուրց պատմության և մշակույթի մեջ գամփռն ունի իր վաստակած կարևոր և ուրույն դերը։",
            "image" => "IMG_4288.webp",
        ],
        [
            "title" => "Պատմություն",
            "content" => "Հայկական գամփռի ստեղծման և զարգացման ամբողջ ընթացքի հարուստ վկաներն են ժամանակակից Հայաստանի Հանրապետության տարածքում ուսումնասիրված ժայռապատկերները, որոնք հիմնականում ընդգրկում են Գեղամա և Սյունիքի լեռները։ 3-ից 7 հազարամյա ժայռապատկերներն ուսումնասիրելիս ապշեցնում է պատկերված շների քանակը։ Ավելի ուշ շրջանի ժայռապատկերներում՝ մ.թ.ա. I հազարամյակ, արդեն ավելի հաճախ պատկերվում են ժամանակակից Գամփռին նման շներ։
Սևանի ավազանում հայտնաբերված դամբարանների պեղումների ժամանակ (մ.թ.ա. I հազարամյակ) գտնվել և ուսումնասիրվել են շան գանգեր, որոնք իրենց ընդհանուր բնութագրերով լրիվ համապատասխան են ժամանակակից Գամփռի գանգին։
Լոռի բերդի պեղումների ժամանակ հայտնաբերվել են մեծ քանակով խեցեղեն, որոնց վրա պատկերված են գամփռանման շներ։",
            "image" => "IMG_4269.webp",
        ],
        [
            "title" => "Հովվաշուն (գելխեղդ)",
            "content" => "Վայրի ոչխարների առկայությունը Հայկական բարձրավանդակում վկայում է, որ ոչխարաբուծությունը ստեղծվել է այստեղ, և անհրաժեշտություն է առաջացել բուծել, ստեղծել խոշոր պահապան շուն, որը կկարողանա միաժամանակ հովվություն անել և պահպանել ոչխարների հոտը գիշատիչներից։
Բազմաթիվ հետազոտությունները և ապացույցները թույլ են տալիս ենթադրել, որ այս ցեղատեսակը իր ներկա վիճակին է ձևավորվել մ.թ.ա. I հազարամյակում, այսինքն մոտ երեք հազարամյակ առաջ։
Միջնադարի հայկական պատմագրերում կան բազմաթիվ պատմություններ գամփռի օգտագործման, բուծման, արժեքի մասին։ 19-րդ դարից արդեն կան եվրոպական ճանափարհորդների գրառումներ, որոնք մանրամասն նկարագրում են հայկական բարձրավանդակի գամփռներին։
Ժամանակակից մեթոդներով Գամփռի բուծման առաջին փորձերը սկսվել են 20-րդ դարի սկզբին խորհրդային շնաբույծների կողմից, որոնք, ընդգրկելով ամբողջ տարածաշրջանի շների տարբեր տիպերին մի խմբի մեջ, մշակեցին ցեղատեսակի զարգացման ընդհանուր ուղղություններ և կոչեցին այն՝ Կովկասյան հովվաշուն։ Այդ տարիներին Հայկական Գամփռի մեծ գլխաքանակ արտակրվեց Հայաստանից։ Գամփռի անզուգական առողջությունը, դիմացկունությունը, հզորությունը, պահապանի բնավորությունը անփոխարինելի էին լայնարձակ Խորհրդային Միության տարբեր վայրերում ծառայելու համար։ Անհաջող փորձեր արվեցին ստեղծել նոր՝ խորհրդային շնացեղատեսակներ, Գամփռին խաչասերելով սենբեռնար, գերմանական հովվաշուն, նյուֆաունդլենդ, դոգ և այլ ցեղատեսակների հետ։ Նմանօրինակ փորձեր այժմ էլ արվում են տարբեր երկրներում:
Ներկայիս Հայաստանի Հանրապետությունում գամփռը օգտագործվում է գյուղատնտեսության՝ հատկապես անասնապահության, մեջ։ Գամփռը թափանցել է նաև այլ ասպարեզներ, պահպանում է տնտեսական և սեփականատիրական տարածքներ թե՛ գյուղերում, և թե՛ քաղաքներում։ Գամփռի բուծմամբ զբաղվում են շնասերների ակումբները, անհատ սիրողները, հովիվները։",
            "image" => "IMG_4224.webp",
        ],
        [
            "title" => "Արշավ Հայկական Գամփռի հետ",
            "content" => "Մենք իրականացնում ենք նախագիծ «արշավ Հայկական Գամփռի հետ»: Արշավի ընթացքում մասնակիցները հնարավորություն են ունենում շփվել կենդանիների հետ: Միասին քայլելն ավելի է մոտեցնում արշավականներին այս բարի ու ընկերասեր շների հետ:

Հատուկ շնորհակալություն Արթուր Դավթյանին Գամփռերի հետ արշավին միանալու և շների մասին հետաքրքիր տեղեկություններ հաղորդելու համար:",
            "image" => "IMG_4160.webp",
        ],
        [
            "title" => "Հայկական գամփռ — Հայաստանի ազգային ցեղատեսակ",
            "content" => '2011 թ.-ի փետրվարի 10-ին Միջազգային կինոլոգիական միության (ՄԿՄ) Մոսկվայում կայացած Ցեղային հանձնաժողովի նիստի ընթացքում ճանաչվել է Գամփռի ստանդարտը։ Նրան շնորհվել է Հայաստանի ազգային ցեղատեսակի կարգավիճակը, և այն գրանցվել է 204 համարի ներքո։ Համաձայն ընդունված ստանդարտի՝ ճանաչվում է Հայկական գամփռի կարճամազ տեսակը (մազածածկույթի երկարությունը՝ 2-ից 6 սմ)։

Հայաստանի հանրային հեռուստաընկերություն / Անծանոթ Հայաստան
<iframe title="Անծանոթ Հայաստան - Հայկական գամփռ" src="https://www.youtube.com/embed/TcPX7aBsB74?feature=oembed&amp;wmode=opaque&amp;rel=0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen="" width="100%" height="600" frameborder="0"></iframe>
',
            "image" => "IMG_4115.webp",
        ],
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->posts as $post){
            Post::create($post);
        }
    }
}
